yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаЗаданиеНаПечать/Module.bsl
&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ДобаитьНаСервере()
	Т = ЭтаФорма.Таб.Добавить();
	Т.Номенклатура = ЭтаФорма.Номенклатура;
	Т.Количество = ЭтаФорма.Количество;
КонецПроцедуры

&НаКлиенте
Процедура Добаить(Команда)
	ДобаитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданиеНаСервере()
	Док = Документы.СК_ЗаданиеНаПечать.СоздатьДокумент();  
	Док.Дата = ТекущаяДата();
	Док.Выполнено = Ложь; 
	//Док.СсылкаДокумент = Объект.Ссылка;
	ТЧ = ЭтаФорма.Таб.Выгрузить();
	Док.Товары.Загрузить(ТЧ);
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка записи");
	КонецПопытки;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	СоздатьЗаданиеНаСервере();  
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	НайтиВыбратьНоменклатуру(Текст); 
		ЭтаФорма.Элементы.Количество.РедактированиеТекста = Истина;

		ПодключитьОбработчикОжидания("АктивироватьКоличество",1,Истина);

КонецПроцедуры


&НаСервере
Процедура НайтиВыбратьНоменклатуру(ШК) 
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);  
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ЭтаФорма.Номенклатура = Рез.Номенклатура;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьКоличество() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	Количество = "";
КонецПроцедуры
